## Import the libary and read the file

In [37]:
import pandas as pd
df = pd.read_csv("balance.csv")

## show the head of the file first 5 culoms

In [38]:
df.head()

   Customer_ID Customer_Name Gender  Balance  Deposite
0            1            Ah      F      500        80
1            2            Ab      F      340        82
2            3            Ah      F     3000        81
3            4            Ab      M      200       120
4            5            Ah      M      120       300

## show the last 5 culoms

In [39]:
df.tail()

    Customer_ID Customer_Name Gender  Balance  Deposite
33           34            Ab      F     3000        64
34           35            Ah      F      200        67
35           36            Ab      F      120        67
36           37            Ah      M      500        68
37           38            Ab      F      123        70

## print the first 4 items we use .head

In [40]:
df.head(4)

   Customer_ID Customer_Name Gender  Balance  Deposite
0            1            Ah      F      500        80
1            2            Ab      F      340        82
2            3            Ah      F     3000        81
3            4            Ab      M      200       120

## print the last 10 items we use .tail

In [41]:
df.tail(10)

    Customer_ID Customer_Name Gender  Balance  Deposite
28           29            Ah      F      200        65
29           30            Ab      F      120        67
30           31            Ah      F      500        66
31           32            Ab      F      123        67
32           33            Ah      F      435        65
33           34            Ab      F     3000        64
34           35            Ah      F      200        67
35           36            Ab      F      120        67
36           37            Ah      M      500        68
37           38            Ab      F      123        70

## change the name of colums
# Customer_ID to ID

In [42]:
df.rename(columns= {"Customer_ID" : "ID","Customer_Name" : "Name"}, inplace=True)

In [43]:
df.head()

   ID Name Gender  Balance  Deposite
0   1   Ah      F      500        80
1   2   Ab      F      340        82
2   3   Ah      F     3000        81
3   4   Ab      M      200       120
4   5   Ah      M      120       300

## Remove a specific Columns
# delete the coloum Gemder

In [44]:
df1 = df.drop(["Gender"], axis=1)

In [45]:
df.head()

   ID Name Gender  Balance  Deposite
0   1   Ah      F      500        80
1   2   Ab      F      340        82
2   3   Ah      F     3000        81
3   4   Ab      M      200       120
4   5   Ah      M      120       300

In [46]:
df1.head()

   ID Name  Balance  Deposite
0   1   Ah      500        80
1   2   Ab      340        82
2   3   Ah     3000        81
3   4   Ab      200       120
4   5   Ah      120       300

##